ЕРПУХАстенд.cbr_Основной/src/Documents/ЗаказНаПроизводство2_2/ЗаказНаПроизводство2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="04b45cc8-19da-4fc2-ab25-fcf16e66f5ee">
  <name>ЗаказНаПроизводство2_2</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ГосЗаказ</name>
    <comment>// Османов Н.М. 27.11.2023 ЧТЗ №2 Управление производством</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпециальныеТребования</name>
    <comment>// Османов Н.М. 27.11.2023 ЧТЗ №2 Управление производством</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="15fca05d-7959-4a2b-9062-e424f3982539">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6df6fc76-a3cd-4de0-a023-25f5c09faf10">
    <name>НачатьНеРанее</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="91b5bd8a-a202-4ee3-a07e-d2244bd4d2bb">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e09e8b15-f8e1-48f5-a895-0a0068c7711a">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="25c088f7-7f66-4e72-9549-39343550e4b5">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ff56eabe-a6d5-4725-a7e1-6d3c1cffefbc">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="191fc3ee-3065-4648-ad89-72b3cbf6a108">
    <name>ДатаПотребности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="88a5e505-c602-47c9-9dd8-4b109bf0874f">
    <name>ДинамическаяСтруктура</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bb924568-6ab5-4bc3-9ed4-53888e5a2470">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="0190487c-4b35-4793-bebb-cdc5d67bf079">
    <name>Продукция</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="a32405d7-b213-4b91-8842-bc3b27c23a17">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dd131bed-f4cf-4ccb-8427-639b59bd5bf2">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7a6e457f-9de3-483b-9f11-8235c0db3365">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ce2f7918-6eb6-44a1-9703-eaa30ed728d8">
      <name>Спецификация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8fb6ec89-8b54-4467-a7ee-20b1f54a8233">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЕРПУХАстенд.cbr_Основной/src/Enums/СтатусыЗаказовНаПроизводство2_2/СтатусыЗаказовНаПроизводство2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="555d6846-e773-489b-bd3c-89b1f2072899">
  <name>СтатусыЗаказовНаПроизводство2_2</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="f552acdf-34c7-46f3-8d72-fc207a70ea04">
    <name>Формируется</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктуализацияСпецификаций</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеСпецтребований</name>
  </enumValues>
  <enumValues>
    <name>Разработка</name>
  </enumValues>
  <enumValues extendedConfigurationObject="c3e0c47c-9d7b-4349-82a5-35dfcec47e59">
    <name>КПроизводству</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаСклад</name>
  </enumValues>
  <enumValues extendedConfigurationObject="7cac9ffb-82fe-4e2c-8db3-94162621dc09">
    <name>Закрыт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ЕРПУХАстенд.cbr_Основной/src/Documents/ЗаказНаПроизводство2_2/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура cbr_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ПодготовитьФорму();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФорму()
	

	Если ФормыУХ.ЭлементыФормыУХУжеСозданы(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
												
	ЭлементГосзаказ = ФормыУХ.СоздатьПолеФормы(Элементы,
												"Госзаказ",
												"Госзаказ",
												"Объект.ГосЗаказ",
												ВидПоляФормы.ПолеФлажка,
												Элементы.СтраницаОсновное,
												Элементы.Комментарий);
												
	ПараметрЭлемента = Новый Структура("МногострочныйРежим, РастягиватьПоГоризонтали, РастягиватьПоВертикали, ПоложениеЗаголовка, Высота", 
										Истина, Истина, Ложь, ПоложениеЗаголовкаЭлементаФормы.Лево, 4);
	ЭлементСпецТребования = ФормыУХ.СоздатьПолеФормы(Элементы,
												"СпециальныеТребования",
												"Спец.требования",
												"Объект.СпециальныеТребования",
												,
												Элементы.СтраницаОсновное,
												Элементы.Комментарий,
												ПараметрЭлемента);
	
	Элементы.Статус.СписокВыбора.Очистить();
	Элементы.Статус.РежимВыбораИзСписка = Истина;
	Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыЗаказовНаПроизводство2_2.Формируется, "Формируется");
	Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыЗаказовНаПроизводство2_2.АктуализацияСпецификаций, "Актуализация спецификаций");
	Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыЗаказовНаПроизводство2_2.КПроизводству, "К производству"); 
	Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыЗаказовНаПроизводство2_2.Закрыт, "Закрыт");
	
	УсловияВидимостиСпецтребований = Документы.СпециальныеТребования.УсловияВидимостиСпецтребований();
	УсловияВидимостиСпецтребований.Логистические = Ложь;
	УсловияВидимостиСпецтребований.Прочие = Ложь;
	Документы.СпециальныеТребования.ВывестиТаблицуСпецТребований(ЭтотОбъект, Элементы.Содержание, УсловияВидимостиСпецтребований, Объект.ДокументОснование);
	
	ИмяКомандыПересчитатьКоличествоУпаковок = "cbr_ПересчитатьКоличествоУпаковокк";
	Команда = ФормыУХ.СоздатьКоманду(ЭтотОбъект, ИмяКомандыПересчитатьКоличествоУпаковок, "", ИмяКомандыПересчитатьКоличествоУпаковок);
	
	ФормыУХ.СоздатьКнопкуФормы(Элементы, 
							  "cbr_ПересчитатьКоличествоУпаковок", 
							  НСтр("ru = 'Пересчитать количество в упаковках'"),
							  ИмяКомандыПересчитатьКоличествоУпаковок,
							  ВидКнопкиФормы.КнопкаКоманднойПанели,
							  Элементы.ПродукцияГруппаДеревоСпецификаций,
							  );

	РежимТолькоПросмотр = РежимТолькоПросмотр();
	Элементы.ПродукцияНоменклатураКод.ТолькоПросмотр = РежимТолькоПросмотр;
	Элементы.ПродукцияНоменклатураТипНоменклатуры.ТолькоПросмотр = РежимТолькоПросмотр;
	Элементы.ПродукцияНоменклатура.ТолькоПросмотр = РежимТолькоПросмотр;
	Элементы.ПродукцияХарактеристика.ТолькоПросмотр = РежимТолькоПросмотр;
	Элементы.ПродукцияАртикул.ТолькоПросмотр = РежимТолькоПросмотр;
    Элементы.ПродукцияНазначение.ТолькоПросмотр = РежимТолькоПросмотр;
	Элементы.ПродукцияКоличествоУпаковок.ТолькоПросмотр = РежимТолькоПросмотр;
	Элементы.ПродукцияУпаковкаЕдиницаИзмерения.ТолькоПросмотр = РежимТолькоПросмотр;
	Элементы.ПродукцияДатаПотребности.ТолькоПросмотр = РежимТолькоПросмотр;
	
	Элементы.ПродукцияРазбитьСтроку.Доступность = Не РежимТолькоПросмотр;

	Элементы.Продукция.УстановитьДействие("ПередУдалением", "Подключаемый_Продукция_ПередУдалением");
	Элементы.Продукция.УстановитьДействие("ПередНачаломДобавления", "Подключаемый_Продукция_ПередНачаломДобавления");
	
	ФормыУХ.ЭлементыФормыУХДобавлены(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Подключаемый_Продукция_ПередУдалением(Элемент, Отказ)
	
	Отказ = РежимТолькоПросмотр();
	
	Если Отказ Тогда 
		ВызватьИсключение НСтр("ru = 'Запрещено удаление строки документа'");
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_Продукция_ПередНачаломДобавления(Элемент, Отказ)
	
	Отказ = РежимТолькоПросмотр();
	
	Если Отказ Тогда 
    	ВызватьИсключение НСтр("ru = 'Запрещено добавление строки документа'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РежимТолькоПросмотр()
	
	Результат = Не Пользователи.РолиДоступны("П3_ИзменениеЗаказНаПроизводствоПродукция")
	            И (ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЗаказКлиента")
					Или ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление"));
	Возврат Результат; 
	
КонецФункции

&НаКлиенте
Процедура cbr_ПересчитатьКоличествоУпаковок(Команда)
	
	cbr_ПересчитатьКоличествоУпаковокНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура cbr_ПересчитатьКоличествоУпаковокНаСервере()
	
	СвойствоУпаковка = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "УпаковкаРеквизитХарактеристики");
	МассивСвойств = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СвойствоУпаковка);
	
	Для Каждого СтрокаПродукции Из Объект.Продукция Цикл
		ТаблицаСвойствХарактеристик = УправлениеСвойствами.ЗначенияСвойств(СтрокаПродукции.Характеристика, Истина, , МассивСвойств);
		
		Если ТаблицаСвойствХарактеристик.Количество() Тогда
			ЗначениеСвойстваХарактеристика = ТаблицаСвойствХарактеристик[0].Значение;
			Если Не СтрокаПродукции.Упаковка = ЗначениеСвойстваХарактеристика Тогда
				КоэффициентУпаковки= Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки
				(ЗначениеСвойстваХарактеристика, СтрокаПродукции.Номенклатура);
				СтрокаПродукции.КоличествоУпаковок = СтрокаПродукции.КоличествоУпаковок / КоэффициентУпаковки;
				СтрокаПродукции.Упаковка = ЗначениеСвойстваХарактеристика;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры
